Titan-Dynamics/TitanLRS/src/lib/WIFI_STM32/ST67WifiOtaMode.cpp
#include "ST67WifiOtaMode.h"

#include <cstring>
#include <cstdlib>
#include <stm32h7xx_hal.h>
#include <ArduinoJson.h>

#include "WebPage.h"
#include "ConfigJSON.h"
#include "options.h"
#include "common.h"

#if defined(TARGET_RX)
#include "config.h"
#elif defined(TARGET_TX)
#include "config.h"
#endif

// ============================================================================
// Static helpers — path/param parsing (not class members)
// ============================================================================

// Check if the HTTP request URL path exactly matches `path`.
// Matches /path followed by ' ', '?', '\r', '\n', or end-of-string.
static bool pathMatch(const char* request, const char* path)
{
    const char* p = strchr(request, '/');
    if (!p) return false;
    size_t len = strlen(path);
    if (strncmp(p, path, len) != 0) return false;
    char next = p[len];
    return next == ' ' || next == '?' || next == '\r' || next == '\n' || next == '\0';
}

// Find the URL query string (the part between '?' and ' HTTP/').
static void extractQueryString(const char* request, const char** qs, int* qsLen)
{
    *qs = nullptr;
    *qsLen = 0;
    const char* httpVer = strstr(request, " HTTP/");
    if (!httpVer) return;
    for (const char* p = request; p < httpVer; p++) {
        if (*p == '?') {
            *qs = p + 1;
            *qsLen = static_cast<int>(httpVer - (p + 1));
            return;
        }
    }
}

// Check if `key` is present as a standalone param key in a query/form string.
static bool paramPresent(const char* str, int len, const char* key)
{
    if (!str || len <= 0) return false;
    int keyLen = static_cast<int>(strlen(key));
    int i = 0;
    while (i < len) {
        if (strncmp(str + i, key, keyLen) == 0) {
            int j = i + keyLen;
            if (j >= len) return true;
            char next = str[j];
            if (next == '=' || next == '&' || next == '\r' || next == '\n' || next == ' ')
                return true;
        }
        // Advance to next param (skip to '&')
        while (i < len && str[i] != '&') i++;
        i++; // skip '&'
    }
    return false;
}

// Extract the URL-decoded value of `key` from a query/form string.
// Returns true and fills valueBuf if found (including flag params with empty value).
static bool paramExtract(const char* str, int len, const char* key,
                         char* valueBuf, int valueBufLen)
{
    if (!str || len <= 0) return false;
    int keyLen = static_cast<int>(strlen(key));
    int i = 0;
    while (i < len) {
        if (strncmp(str + i, key, keyLen) == 0) {
            int j = i + keyLen;
            if (j < len && str[j] == '=') {
                j++;
                int vStart = j;
                while (j < len && str[j] != '&' && str[j] != '\r' && str[j] != '\n' && str[j] != ' ')
                    j++;
                if (valueBuf && valueBufLen > 0) {
                    int out = 0;
                    for (int k = vStart; k < j && out < valueBufLen - 1; k++) {
                        char c = str[k];
                        if (c == '%' && k + 2 < j) {
                            char hex[3] = {str[k+1], str[k+2], 0};
                            valueBuf[out++] = static_cast<char>(strtol(hex, nullptr, 16));
                            k += 2;
                        } else if (c == '+') {
                            valueBuf[out++] = ' ';
                        } else {
                            valueBuf[out++] = c;
                        }
                    }
                    valueBuf[out] = '\0';
                }
                return true;
            }
            // Flag param (no '=' value)
            if (j >= len || str[j] == '&' || str[j] == '\r' || str[j] == '\n' || str[j] == ' ') {
                if (valueBuf && valueBufLen > 0) valueBuf[0] = '\0';
                return true;
            }
        }
        while (i < len && str[i] != '&') i++;
        i++;
    }
    return false;
}

// ============================================================================
// ST67WifiOtaMode::start / service
// ============================================================================

bool ST67WifiOtaMode::start()
{
    if (_active) {
        return true;
    }

    Serial.println(F("\n========================================"));
    Serial.println(F("  Entering ST67 WiFi OTA mode"));
    Serial.println(F("========================================"));
    Serial.flush();
    delay(50);

    if (!_wifi.begin()) {
        Serial.println(F("FATAL: ST67 module did not respond."));
        return false;
    }

    if (!_wifi.startAP(AP_SSID, AP_PASSWORD, AP_CHANNEL, AP_ECN)) {
        Serial.println(F("FATAL: Could not start Soft-AP"));
        return false;
    }

    if (!_wifi.startDHCP()) {
        Serial.println(F("FATAL: Could not enable DHCP"));
        return false;
    }

    char ipBuf[32] = {0};
    if (_wifi.getAPIP(ipBuf, sizeof(ipBuf))) {
        Serial.printf("AP IP: %s\n", ipBuf);
        Serial.printf("Connect to Wi-Fi \"%s\"  password \"%s\"\n", AP_SSID, AP_PASSWORD);
        Serial.printf("Then open http://%s in a browser.\n", ipBuf);
    } else {
        Serial.println(F("WARNING: Could not read AP IP address"));
    }

    if (!_wifi.startTCPServer(80)) {
        Serial.println(F("FATAL: Could not start TCP server"));
        return false;
    }

    _wifi.at.sendCommand("AT+CIPSTO=120");
    Serial.println(F("WiFi OTA mode is active"));

    _active = true;
    return true;
}

void ST67WifiOtaMode::service()
{
    if (!_active) {
        return;
    }

    if (_pendingReboot && millis() >= _rebootAt) {
        Serial.println(F("[OTA] Rebooting now..."));
        delay(100);
        NVIC_SystemReset();
    }

    if (_otaUpdater.isStarted() && _updateState == UpdateState::IDLE &&
        _eraseDeadlineMs > 0 && millis() >= _eraseDeadlineMs) {
        Serial.println(F("[OTA] Erase watchdog: no upload received, aborting"));
        _otaUpdater.abort();
        _eraseDeadlineMs = 0;
    }

    int linkId = -1;
    int n = _wifi.checkForClient(_clientBuf, sizeof(_clientBuf), &linkId);

    if (n > 0 && linkId >= 0) {
        if (_updateState == UpdateState::RECEIVING && linkId == _updateLinkId) {
            if (looksLikeHttpRequest(_clientBuf, n)) {
                Serial.printf("[OTA] Upload stream replaced by new request on link %d, aborting upload\n", linkId);
                _otaUpdater.abort();
                _updateState = UpdateState::IDLE;
                _updateLinkId = -1;
                _eraseDeadlineMs = 0;
                _uploadDiscPending = false;
                handleClientRequest(linkId, _clientBuf, n);
                return;
            }

