Titan-Dynamics/TitanLRS/src/lib/WIFI_STM32/ST67WifiOtaMode.cpp
            _updateLastDataMs = millis();
            if (_uploadDiscPending) {
                Serial.println(F("[OTA] Upload resumed"));
                _uploadDiscPending = false;
            }
            handleUploadData(linkId, _clientBuf, n);
        } else {
            handleClientRequest(linkId, _clientBuf, n);
        }
    } else if (n == 0 && _updateState == UpdateState::RECEIVING) {
        const char* cip = strstr(_clientBuf, "+CIP:");
        int evtLink = -1;
        if (cip) {
            cip += 5;
            int v = 0;
            bool hasDigit = false;
            while (*cip >= '0' && *cip <= '9') {
                hasDigit = true;
                v = v * 10 + (*cip - '0');
                cip++;
            }
            if (hasDigit) {
                evtLink = v;
            }
        }

        const bool isDisc = (strstr(_clientBuf, "DISCONNECTED") != nullptr);
        const bool isConn = (strstr(_clientBuf, "CONNECTED") != nullptr) && !isDisc;

        if (evtLink == _updateLinkId && isDisc && (millis() - _updateStartMs) > 2000) {
            if (!_uploadDiscPending) {
                _uploadDiscPending = true;
                Serial.printf("[OTA] Upload link %d disconnect seen\n", evtLink);
            }
        } else if (evtLink == _updateLinkId && isConn) {
            if (_uploadDiscPending) {
                _uploadDiscPending = false;
                Serial.printf("[OTA] Upload link %d reconnected\n", evtLink);
            }
        }
    }

    if (_updateState == UpdateState::RECEIVING &&
        (millis() - _updateLastDataMs) > UPLOAD_STALL_TIMEOUT_MS) {
        Serial.println(F("[OTA] Upload stalled, aborting"));
        _otaUpdater.abort();
        _updateState = UpdateState::IDLE;
        _updateLinkId = -1;
        _eraseDeadlineMs = 0;
        _uploadDiscPending = false;
    }

    if (_updateState == UpdateState::IDLE) {
        delay(5);
    }
}

// ============================================================================
// Response helpers
// ============================================================================

void ST67WifiOtaMode::sendHttpResponse(int linkId, const char* status,
                                       const char* contentType, const char* body,
                                       bool closeConn)
{
    char hdr[256];
    uint16_t bodyLen = body ? static_cast<uint16_t>(strlen(body)) : 0;
    int hdrLen = snprintf(hdr, sizeof(hdr),
                          "HTTP/1.1 %s\r\n"
                          "Content-Type: %s\r\n"
                          "Content-Length: %u\r\n"
                          "Connection: %s\r\n"
                          "\r\n",
                          status, contentType, bodyLen, closeConn ? "close" : "keep-alive");

    _wifi.sendResponse(linkId, reinterpret_cast<const uint8_t*>(hdr), static_cast<uint16_t>(hdrLen));
    if (bodyLen > 0) {
        _wifi.sendResponse(linkId, reinterpret_cast<const uint8_t*>(body), bodyLen);
    }

    if (closeConn) {
        delay(50);
        _wifi.closeConnection(linkId);
    }
}

// ============================================================================
// Request parsing helpers
// ============================================================================

const char* ST67WifiOtaMode::extractBody(const char* request, int reqLen, int* bodyLen) const
{
    const char* bodyStart = strstr(request, "\r\n\r\n");
    if (!bodyStart) { *bodyLen = 0; return nullptr; }
    bodyStart += 4;
    int32_t cl = parseContentLength(request);
    if (cl > 0) {
        *bodyLen = static_cast<int>(cl);
    } else {
        *bodyLen = reqLen - static_cast<int>(bodyStart - request);
        if (*bodyLen < 0) *bodyLen = 0;
    }
    return bodyStart;
}

bool ST67WifiOtaMode::hasParam(const char* request, int reqLen, const char* name) const
{
    const char* qs; int qsLen;
    extractQueryString(request, &qs, &qsLen);
    if (paramPresent(qs, qsLen, name)) return true;

    int bodyLen = 0;
    const char* body = extractBody(request, reqLen, &bodyLen);
    return paramPresent(body, bodyLen, name);
}

bool ST67WifiOtaMode::getParam(const char* request, int reqLen, const char* name,
                                char* valueBuf, int valueBufLen) const
{
    const char* qs; int qsLen;
    extractQueryString(request, &qs, &qsLen);
    if (paramExtract(qs, qsLen, name, valueBuf, valueBufLen)) return true;

    int bodyLen = 0;
    const char* body = extractBody(request, reqLen, &bodyLen);
    return paramExtract(body, bodyLen, name, valueBuf, valueBufLen);
}

// ============================================================================
// Request dispatch
// ============================================================================

void ST67WifiOtaMode::handleClientRequest(int linkId, const char* request, int reqLen)
{
    const char* eol = strchr(request, '\r');
    if (eol) {
        char line[128];
        int lineLen = static_cast<int>(eol - request);
        if (lineLen > static_cast<int>(sizeof(line) - 1)) lineLen = sizeof(line) - 1;
        memcpy(line, request, lineLen);
        line[lineLen] = '\0';
        Serial.printf("[HTTP] %s\n", line);
    }

    const bool isGet  = (strncmp(request, "GET ",  4) == 0);
    const bool isPost = (strncmp(request, "POST ", 5) == 0);

    // Config endpoints (POST before GET to disambiguate)
    if      (isPost && pathMatch(request, "/config"))       { handlePostConfig(linkId, request, reqLen); }
    else if (isGet  && pathMatch(request, "/config"))       { handleGetConfig(linkId, request); }
    // Options endpoints
    else if (isPost && pathMatch(request, "/options.json")) { handlePostOptions(linkId, request, reqLen); }
    else if (isGet  && pathMatch(request, "/options.json")) { handleGetOptions(linkId); }
    else if (isGet  && pathMatch(request, "/options"))      { serveAsset(linkId, "/options.html"); }
    // Reboot / reset
    else if (isGet  && pathMatch(request, "/reboot"))       { handleGetReboot(linkId); }
    else if (isGet  && pathMatch(request, "/reset"))        { handleGetReset(linkId, request, reqLen); }
    // WiFi management
    else if (isGet  && pathMatch(request, "/networks.json")){ handleGetNetworks(linkId); }
    else if (isPost && pathMatch(request, "/sethome"))      { handlePostSethome(linkId, request, reqLen); }
    else if (isPost && pathMatch(request, "/forget"))       { handlePostForget(linkId, request, reqLen); }
    else if (isGet  && pathMatch(request, "/wifi"))         { serveAsset(linkId, "/wifi.html"); }
#if defined(TARGET_TX)
    // TX-only endpoints
    else if (isPost && pathMatch(request, "/import"))       { handlePostImport(linkId, request, reqLen); }
    else if (isGet  && pathMatch(request, "/import"))       { serveAsset(linkId, "/import.html"); }
    else if (isPost && pathMatch(request, "/buttons"))      { handlePostButtons(linkId, request, reqLen); }
    else if (isGet  && pathMatch(request, "/buttons"))      { serveAsset(linkId, "/buttons.html"); }
#endif
    // OTA endpoints
    else if (isPost && pathMatch(request, "/erase"))        { handlePostErase(linkId, request, reqLen); }
    else if (isPost && pathMatch(request, "/upload"))       { handlePostUpload(linkId, request, reqLen); }
    // Static pages
    else if (isGet  && pathMatch(request, "/binding"))      { serveAsset(linkId, "/binding.html"); }
    else if (isGet  && pathMatch(request, "/update"))       { serveAsset(linkId, "/update.html"); }
    else if (isGet  && (pathMatch(request, "/") || strstr(request, "GET /index"))) {
        serveAsset(linkId, "/index.html");
    }
    else { sendHttpResponse(linkId, "404 Not Found", "text/plain", "404 - Not Found"); }
}

// ============================================================================
// GET /config  (and GET /config?export)
// ============================================================================

void ST67WifiOtaMode::handleGetConfig(int linkId, const char* request)
{
    bool exportMode = hasParam(request, 0, "export");

    // TX export with 64 model configs needs a large buffer; RX/non-export fits in 2KB.
    // Allocate from heap to avoid stack overflow in the export case.
    const size_t bufSize = exportMode ? 16384 : 2048;
    char* body = new char[bufSize];
    if (!body) {
        sendHttpResponse(linkId, "500 Internal Server Error", "text/plain", "Out of memory");
        return;
    }

    int bodyLen = buildConfigJSON(body, bufSize, exportMode);

    char hdr[256];
    int hdrLen = snprintf(hdr, sizeof(hdr),
        "HTTP/1.1 200 OK\r\n"
        "Content-Type: application/json\r\n"
        "Content-Length: %d\r\n"
        "Access-Control-Allow-Origin: *\r\n"
        "Connection: close\r\n"
        "\r\n", bodyLen);

    _wifi.sendResponse(linkId, reinterpret_cast<const uint8_t*>(hdr), static_cast<uint16_t>(hdrLen));
    _wifi.sendResponse(linkId, reinterpret_cast<const uint8_t*>(body), static_cast<uint16_t>(bodyLen));
    delay(50);
    _wifi.closeConnection(linkId);

