Titan-Dynamics/TitanLRS/src/lib/WIFI_STM32/ST67WifiOtaMode.cpp
    delete[] body;
}

// ============================================================================
// GET /reboot
// ============================================================================

void ST67WifiOtaMode::handleGetReboot(int linkId)
{
    // Match ESP response: "Kill -9, no more CPU time!" with Connection: close
    sendHttpResponse(linkId, "200 OK", "application/json", "Kill -9, no more CPU time!");
    _pendingReboot = true;
    _rebootAt = millis() + 100;
}

// ============================================================================
// GET /reset?options&model
// ============================================================================

void ST67WifiOtaMode::handleGetReset(int linkId, const char* request, int reqLen)
{
    if (hasParam(request, reqLen, "options")) {
        resetOptionsToDefaults();
#if defined(TARGET_RX)
        // Match ESP: also reset model ID and force-tlm when resetting options
        config.SetModelId(255);
        config.SetForceTlmOff(false);
        config.Commit();
#endif
    }
    if (hasParam(request, reqLen, "model") || hasParam(request, reqLen, "config")) {
        config.SetDefaults(true);
    }
    sendHttpResponse(linkId, "200 OK", "application/json", "Reset complete, rebooting...");
    _pendingReboot = true;
    _rebootAt = millis() + 100;
}

// ============================================================================
// GET /options.json
// ============================================================================

void ST67WifiOtaMode::handleGetOptions(int linkId)
{
    char body[512];
    int bodyLen = buildOptionsJSON(body, sizeof(body));

    char hdr[256];
    int hdrLen = snprintf(hdr, sizeof(hdr),
        "HTTP/1.1 200 OK\r\n"
        "Content-Type: application/json\r\n"
        "Content-Length: %d\r\n"
        "Access-Control-Allow-Origin: *\r\n"
        "Connection: close\r\n"
        "\r\n", bodyLen);

    _wifi.sendResponse(linkId, reinterpret_cast<const uint8_t*>(hdr), static_cast<uint16_t>(hdrLen));
    _wifi.sendResponse(linkId, reinterpret_cast<const uint8_t*>(body), static_cast<uint16_t>(bodyLen));
    delay(50);
    _wifi.closeConnection(linkId);
}

// ============================================================================
// POST /config
// ============================================================================

void ST67WifiOtaMode::handlePostConfig(int linkId, const char* request, int reqLen)
{
    int bodyLen = 0;
    const char* body = extractBody(request, reqLen, &bodyLen);
    if (!body || bodyLen <= 0) {
        sendHttpResponse(linkId, "400 Bad Request", "text/plain", "Missing body");
        return;
    }

    JsonDocument doc;
    DeserializationError err = deserializeJson(doc, body, static_cast<size_t>(bodyLen));
    if (err) {
        sendHttpResponse(linkId, "400 Bad Request", "text/plain", "Invalid JSON");
        return;
    }

#if defined(TARGET_RX)
    if (!doc["serial-protocol"].isNull())
        config.SetSerialProtocol((eSerialProtocol)doc["serial-protocol"].as<uint8_t>());
    if (!doc["sbus-failsafe"].isNull())
        config.SetFailsafeMode((eFailsafeMode)doc["sbus-failsafe"].as<uint8_t>());
    if (!doc["modelid"].isNull()) {
        long modelid = doc["modelid"].as<long>();
        if (modelid < 0 || modelid > 63) modelid = 255;
        config.SetModelId(static_cast<uint8_t>(modelid));
    }
    if (!doc["force-tlm"].isNull())
        config.SetForceTlmOff(doc["force-tlm"].as<bool>());
    if (!doc["vbind"].isNull())
        config.SetBindStorage((rx_config_bindstorage_t)doc["vbind"].as<uint8_t>());
    if (doc["uid"].is<JsonArray>()) {
        JsonArray juid = doc["uid"].as<JsonArray>();
        uint8_t newUid[UID_LEN] = {0};
        size_t juidLen = juid.size() < UID_LEN ? juid.size() : UID_LEN;
        // Right-justify into newUid (supports 4-byte OTA-bound UID)
        for (size_t i = 0; i < juidLen; i++)
            newUid[UID_LEN - juidLen + i] = juid[i].as<uint8_t>();
        if (memcmp(newUid, config.GetUID(), UID_LEN) != 0) {
            config.SetUID(newUid);
            memcpy(UID, newUid, UID_LEN);
        }
    }
    if (doc["pwm"].is<JsonArray>()) {
        JsonArray pwm = doc["pwm"].as<JsonArray>();
        for (uint32_t ch = 0; ch < pwm.size(); ch++) {
            config.SetPwmChannelRaw(static_cast<uint8_t>(ch), pwm[ch].as<uint32_t>());
        }
    }
    config.Commit();

#elif defined(TARGET_TX)
    if (doc["button-actions"].is<JsonArray>()) {
        JsonArray array = doc["button-actions"].as<JsonArray>();
        for (size_t button = 0; button < array.size() && button < 2; button++) {
            tx_button_color_t action = {};
            action.val.color = array[button]["color"].as<uint8_t>();
            for (int act = 0; act < CONFIG_TX_BUTTON_ACTION_CNT; act++) {
                action.val.actions[act].pressType = array[button]["action"][act]["is-long-press"].as<bool>();
                action.val.actions[act].count     = array[button]["action"][act]["count"].as<uint8_t>();
                action.val.actions[act].action    = array[button]["action"][act]["action"].as<uint8_t>();
            }
            config.SetButtonActions(static_cast<uint8_t>(button), &action);
        }
    }
    config.Commit();
#endif

    sendHttpResponse(linkId, "200 OK", "text/plain", "Configuration updated");
}

// ============================================================================
// POST /options.json
// ============================================================================

void ST67WifiOtaMode::handlePostOptions(int linkId, const char* request, int reqLen)
{
    int bodyLen = 0;
    const char* body = extractBody(request, reqLen, &bodyLen);
    if (!body || bodyLen <= 0) {
        sendHttpResponse(linkId, "400 Bad Request", "text/plain", "Missing body");
        return;
    }

    JsonDocument doc;
    DeserializationError err = deserializeJson(doc, body, static_cast<size_t>(bodyLen));
    if (err) {
        sendHttpResponse(linkId, "400 Bad Request", "text/plain", "Invalid JSON");
        return;
    }

