Titan-Dynamics/TitanLRS/src/lib/WIFI_STM32/ST67WifiOtaMode.cpp
    // Validate flash-discriminator to prevent stale writes (matches ESP behaviour)
    if (firmwareOptions.flash_discriminator != doc["flash-discriminator"].as<uint32_t>()) {
        sendHttpResponse(linkId, "409 Conflict", "text/plain",
                         "Mismatched device identifier, refresh the page and try again.");
        return;
    }

    // Apply fields from JSON
    if (doc["uid"].is<JsonArray>()) {
        JsonArray uid = doc["uid"].as<JsonArray>();
        size_t len = uid.size() < 6 ? uid.size() : 6;
        for (size_t i = 0; i < len; i++)
            firmwareOptions.uid[i] = uid[i].as<uint8_t>();
        firmwareOptions.hasUID = (len > 0);
    }
    if (!doc["wifi-on-interval"].isNull()) {
        int32_t interval = doc["wifi-on-interval"].as<int32_t>();
        firmwareOptions.wifi_auto_on_interval = (interval < 0) ? -1 : interval * 1000;
    }
    if (!doc["wifi-ssid"].isNull())
        strlcpy(firmwareOptions.home_wifi_ssid, doc["wifi-ssid"] | "", sizeof(firmwareOptions.home_wifi_ssid));
    if (!doc["wifi-password"].isNull())
        strlcpy(firmwareOptions.home_wifi_password, doc["wifi-password"] | "", sizeof(firmwareOptions.home_wifi_password));
    if (!doc["domain"].isNull())
        firmwareOptions.domain = doc["domain"].as<uint8_t>();
    if (!doc["is-airport"].isNull())
        firmwareOptions.is_airport = doc["is-airport"].as<bool>();
#if defined(TARGET_RX)
    if (!doc["rcvr-uart-baud"].isNull())
        firmwareOptions.uart_baud = doc["rcvr-uart-baud"].as<uint32_t>();
    if (!doc["lock-on-first-connection"].isNull())
        firmwareOptions.lock_on_first_connection = doc["lock-on-first-connection"].as<bool>();
#elif defined(TARGET_TX)
    if (!doc["tlm-interval"].isNull())
        firmwareOptions.tlm_report_interval = doc["tlm-interval"].as<uint32_t>();
    if (!doc["fan-runtime"].isNull())
        firmwareOptions.fan_min_runtime = doc["fan-runtime"].as<uint32_t>();
    if (!doc["unlock-higher-power"].isNull())
        firmwareOptions.unlock_higher_power = doc["unlock-higher-power"].as<bool>();
    if (!doc["airport-uart-baud"].isNull())
        firmwareOptions.uart_baud = doc["airport-uart-baud"].as<uint32_t>();
#endif

    saveOptions();
    sendHttpResponse(linkId, "200 OK", "text/plain", "Options updated");
}

// ============================================================================
// GET /networks.json
// ============================================================================

void ST67WifiOtaMode::handleGetNetworks(int linkId)
{
    // TODO: Use AT+CWLAP to scan for networks via ST67 AT command interface.
    // AT+CWLAP is blocking and can take several seconds, which would stall the
    // HTTP server. Implement asynchronous scanning before enabling this.
    // For now, return an empty array so the WiFi page loads without errors.
    sendHttpResponse(linkId, "200 OK", "application/json", "[]");
}

// ============================================================================
// POST /sethome
// ============================================================================

void ST67WifiOtaMode::handlePostSethome(int linkId, const char* request, int reqLen)
{
    char network[33]  = {0};
    char password[65] = {0};
    char onIntervalBuf[16] = {0};

    getParam(request, reqLen, "network",          network,       sizeof(network));
    getParam(request, reqLen, "password",          password,      sizeof(password));
    getParam(request, reqLen, "wifi-on-interval",  onIntervalBuf, sizeof(onIntervalBuf));

    if (hasParam(request, reqLen, "save")) {
        strlcpy(firmwareOptions.home_wifi_ssid,     network,  sizeof(firmwareOptions.home_wifi_ssid));
        strlcpy(firmwareOptions.home_wifi_password, password, sizeof(firmwareOptions.home_wifi_password));
        int32_t interval = onIntervalBuf[0] ? static_cast<int32_t>(atoi(onIntervalBuf)) : -1;
        firmwareOptions.wifi_auto_on_interval = (interval < 0) ? -1 : interval * 1000;
        saveOptions();
    }

    // Note: STM32/ST67 is AP-only and cannot switch to STA mode.
    // Credentials are saved for future use but no connection is attempted.
    sendHttpResponse(linkId, "200 OK", "text/plain", "WiFi credentials saved.");
}

// ============================================================================
// POST /forget
// ============================================================================

void ST67WifiOtaMode::handlePostForget(int linkId, const char* request, int reqLen)
{
    char onIntervalBuf[16] = {0};
    getParam(request, reqLen, "wifi-on-interval", onIntervalBuf, sizeof(onIntervalBuf));

    firmwareOptions.home_wifi_ssid[0]     = 0;
    firmwareOptions.home_wifi_password[0] = 0;
    int32_t interval = onIntervalBuf[0] ? static_cast<int32_t>(atoi(onIntervalBuf)) : -1;
    firmwareOptions.wifi_auto_on_interval = (interval < 0) ? -1 : interval * 1000;
    saveOptions();

    sendHttpResponse(linkId, "200 OK", "text/plain", "Home network forgotten.");
}

// ============================================================================
// TX-only: POST /import  and  POST /buttons
// ============================================================================

#if defined(TARGET_TX)

void ST67WifiOtaMode::handlePostImport(int linkId, const char* request, int reqLen)
{
    int bodyLen = 0;
    const char* body = extractBody(request, reqLen, &bodyLen);
    if (!body || bodyLen <= 0) {
        sendHttpResponse(linkId, "400 Bad Request", "text/plain", "Missing body");
        return;
    }

    // Import JSON can be large (64 model configs). Use heap allocation.
    JsonDocument* docPtr = new JsonDocument();
    if (!docPtr) {
        sendHttpResponse(linkId, "500 Internal Server Error", "text/plain", "Out of memory");
        return;
    }
    JsonDocument& doc = *docPtr;

    DeserializationError err = deserializeJson(doc, body, static_cast<size_t>(bodyLen));
    if (err) {
        delete docPtr;
        sendHttpResponse(linkId, "400 Bad Request", "text/plain", "Invalid JSON");
        return;
    }

    // Unwrap outer "config" key if present (matches ESP ImportConfiguration)
    JsonVariant cfg = doc["config"].is<JsonObject>() ? doc["config"] : doc.as<JsonVariant>();

    if (!cfg["fan-mode"].isNull())           config.SetFanMode(cfg["fan-mode"].as<uint8_t>());
    if (!cfg["power-fan-threshold"].isNull()) config.SetPowerFanThreshold(cfg["power-fan-threshold"].as<uint8_t>());
    if (!cfg["motion-mode"].isNull())         config.SetMotionMode(cfg["motion-mode"].as<uint8_t>());

    if (cfg["vtx-admin"].is<JsonObject>()) {
        JsonObject vtx = cfg["vtx-admin"].as<JsonObject>();
        if (!vtx["band"].isNull())    config.SetVtxBand(vtx["band"].as<uint8_t>());
        if (!vtx["channel"].isNull()) config.SetVtxChannel(vtx["channel"].as<uint8_t>());
        if (!vtx["pitmode"].isNull()) config.SetVtxPitmode(vtx["pitmode"].as<uint8_t>());
        if (!vtx["power"].isNull())   config.SetVtxPower(vtx["power"].as<uint8_t>());
    }

    if (cfg["backpack"].is<JsonObject>()) {
        JsonObject bp = cfg["backpack"].as<JsonObject>();
        if (!bp["disabled"].isNull())         config.SetBackpackDisable(bp["disabled"].as<bool>());
        if (!bp["dvr-start-delay"].isNull())  config.SetDvrStartDelay(bp["dvr-start-delay"].as<uint8_t>());
        if (!bp["dvr-stop-delay"].isNull())   config.SetDvrStopDelay(bp["dvr-stop-delay"].as<uint8_t>());
        if (!bp["dvr-aux-channel"].isNull())  config.SetDvrAux(bp["dvr-aux-channel"].as<uint8_t>());
        if (!bp["telemetry-mode"].isNull())   config.SetBackpackTlmMode(bp["telemetry-mode"].as<uint8_t>());
    }

