Titan-Dynamics/TitanLRS/src/lib/WIFI_STM32/ST67WifiOtaMode.cpp
    if (cfg["model"].is<JsonObject>()) {
        for (JsonPair kv : cfg["model"].as<JsonObject>()) {
            uint8_t model = static_cast<uint8_t>(atoi(kv.key().c_str()));
            JsonObject mc = kv.value().as<JsonObject>();
            config.SetModelId(model);
            if (!mc["packet-rate"].isNull())     config.SetRate(mc["packet-rate"].as<uint8_t>());
            if (!mc["telemetry-ratio"].isNull())  config.SetTlm(mc["telemetry-ratio"].as<uint8_t>());
            if (!mc["switch-mode"].isNull())      config.SetSwitchMode(mc["switch-mode"].as<uint8_t>());
            if (!mc["link-mode"].isNull())        config.SetLinkMode(mc["link-mode"].as<uint8_t>());
            if (!mc["model-match"].isNull())      config.SetModelMatch(mc["model-match"].as<bool>());
            if (!mc["tx-antenna"].isNull())       config.SetAntennaMode(mc["tx-antenna"].as<uint8_t>());
            if (!mc["ptr-start-chan"].isNull())   config.SetPTRStartChannel(mc["ptr-start-chan"].as<uint8_t>());
            if (!mc["ptr-enable-chan"].isNull())  config.SetPTREnableChannel(mc["ptr-enable-chan"].as<uint8_t>());
            if (mc["power"].is<JsonObject>()) {
                JsonObject pwr = mc["power"].as<JsonObject>();
                if (!pwr["max-power"].isNull())      config.SetPower(pwr["max-power"].as<uint8_t>());
                if (!pwr["dynamic-power"].isNull())  config.SetDynamicPower(pwr["dynamic-power"].as<bool>());
                if (!pwr["boost-channel"].isNull())  config.SetBoostChannel(pwr["boost-channel"].as<uint8_t>());
            }
            config.Commit(); // commit after each model update
        }
    }

    // Also apply button-actions from the imported config
    if (cfg["button-actions"].is<JsonArray>()) {
        JsonArray array = cfg["button-actions"].as<JsonArray>();
        for (size_t button = 0; button < array.size() && button < 2; button++) {
            tx_button_color_t action = {};
            action.val.color = array[button]["color"].as<uint8_t>();
            for (int act = 0; act < CONFIG_TX_BUTTON_ACTION_CNT; act++) {
                action.val.actions[act].pressType = array[button]["action"][act]["is-long-press"].as<bool>();
                action.val.actions[act].count     = array[button]["action"][act]["count"].as<uint8_t>();
                action.val.actions[act].action    = array[button]["action"][act]["action"].as<uint8_t>();
            }
            config.SetButtonActions(static_cast<uint8_t>(button), &action);
        }
        config.Commit();
    }

    delete docPtr;
    sendHttpResponse(linkId, "200 OK", "text/plain", "Import/update complete");
}

void ST67WifiOtaMode::handlePostButtons(int linkId, const char* request, int reqLen)
{
    int bodyLen = 0;
    const char* body = extractBody(request, reqLen, &bodyLen);
    if (!body || bodyLen <= 0) {
        sendHttpResponse(linkId, "200 OK", "text/plain", "OK");
        return;
    }

    JsonDocument doc;
    if (deserializeJson(doc, body, static_cast<size_t>(bodyLen)) == DeserializationError::Ok
        && doc.is<JsonArray>()) {
        (void)doc[0].as<int>(); // color1 — placeholder until STM32 TX button LEDs confirmed
        (void)doc[1].as<int>(); // color2
        // TODO: Call setButtonColors(color1, color2) once STM32 TX button LED
        // support is confirmed (requires checking GPIO_PIN_BUTTON / GPIO_PIN_BUTTON2).
    }
    sendHttpResponse(linkId, "200 OK", "text/plain", "OK");
}

#endif // TARGET_TX

// ============================================================================
// Asset serving
// ============================================================================

void ST67WifiOtaMode::serveAsset(int linkId, const char* path)
{
    for (size_t i = 0; i < WEB_ASSETS_COUNT; i++) {
        if (strcmp(path, WEB_ASSETS[i].path) == 0) {
            char hdr[256];
            int hdrLen = snprintf(hdr, sizeof(hdr),
                "HTTP/1.1 200 OK\r\n"
                "Content-Type: %s\r\n"
                "Content-Encoding: gzip\r\n"
                "Content-Length: %u\r\n"
                "Cache-Control: no-store\r\n"
                "Connection: close\r\n"
                "\r\n",
                WEB_ASSETS[i].content_type,
                (unsigned)WEB_ASSETS[i].size);

            bool ok = _wifi.sendResponse(linkId, reinterpret_cast<const uint8_t*>(hdr), static_cast<uint16_t>(hdrLen));
            if (ok) {
                ok = _wifi.sendResponse(linkId, WEB_ASSETS[i].data, static_cast<uint16_t>(WEB_ASSETS[i].size));
            }
            // Wait for the ST67 to deliver all TCP data before closing.
            delay(ok ? 300 : 50);
            _wifi.closeConnection(linkId);
            return;
        }
    }
    sendHttpResponse(linkId, "404 Not Found", "text/plain", "Not found");
}

// ============================================================================
// OTA upload handlers (unchanged)
// ============================================================================

void ST67WifiOtaMode::handlePostErase(int linkId, const char* request, int reqLen)
{
    (void)reqLen;

    if (_pendingReboot) {
        sendHttpResponse(linkId, "503 Service Unavailable", "text/plain", "Rebooting after previous update");
        return;
    }

    int32_t imageSize = parseImageSize(request);
    if (imageSize <= 0) {
        imageSize = parseContentLength(request);
    }
    if (imageSize <= 0) {
        sendHttpResponse(linkId, "400 Bad Request", "text/plain", "Missing X-Image-Size header");
        return;
    }

    Serial.printf("[OTA] POST /erase image size = %ld bytes\n", static_cast<long>(imageSize));
    Serial.println(F("[OTA] Erasing inactive bank..."));

    if (!_otaUpdater.begin(static_cast<uint32_t>(imageSize))) {
        char errBuf[128];
        snprintf(errBuf, sizeof(errBuf), "Erase failed: %s", _otaUpdater.lastError());
        Serial.printf("[OTA] %s\n", errBuf);
        sendHttpResponse(linkId, "500 Internal Server Error", "text/plain", errBuf);
        return;
    }

    drainSpiFrames();

