Titan-Dynamics/TitanLRS/src/lib/WIFI_STM32/ST67WifiOtaMode.cpp
    _eraseDeadlineMs = millis() + ERASE_TIMEOUT_MS;
    sendHttpResponse(linkId, "200 OK", "text/plain", "ready", false);
}

void ST67WifiOtaMode::handlePostUpload(int linkId, const char* request, int reqLen)
{
    if (_pendingReboot) {
        sendHttpResponse(linkId, "503 Service Unavailable", "text/plain", "Rebooting after previous update");
        return;
    }

    if (!_otaUpdater.isStarted()) {
        sendHttpResponse(linkId, "400 Bad Request", "text/plain", "Flash not erased - call POST /erase first");
        return;
    }

    if (_updateState != UpdateState::IDLE) {
        sendHttpResponse(linkId, "409 Conflict", "text/plain", "Upload already in progress");
        return;
    }

    int32_t contentLength = parseContentLength(request);
    if (contentLength <= 0) {
        sendHttpResponse(linkId, "400 Bad Request", "text/plain", "Missing Content-Length");
        return;
    }

    if (static_cast<uint32_t>(contentLength) != _otaUpdater.imageSize()) {
        char errBuf[128];
        snprintf(errBuf, sizeof(errBuf), "Content-Length %ld != erased size %lu",
                 static_cast<long>(contentLength),
                 static_cast<unsigned long>(_otaUpdater.imageSize()));
        Serial.printf("[OTA] %s\n", errBuf);
        sendHttpResponse(linkId, "400 Bad Request", "text/plain", errBuf);
        return;
    }

    _eraseDeadlineMs = 0;
    _updateState = UpdateState::RECEIVING;
    _updateLinkId = linkId;
    _updateBytesLeft = static_cast<uint32_t>(contentLength);
    _updateStartMs = millis();
    _updateLastDataMs = _updateStartMs;
    _uploadDiscPending = false;
    _lastProgressAt = 0;

    const char* bodyStart = strstr(request, "\r\n\r\n");
    if (bodyStart) {
        bodyStart += 4;
        int bodyBytes = reqLen - static_cast<int>(bodyStart - request);
        if (bodyBytes > 0) {
            handleUploadData(linkId, bodyStart, bodyBytes);
        }
    }
}

void ST67WifiOtaMode::handleUploadData(int linkId, const char* data, int len)
{
    if (_updateState != UpdateState::RECEIVING) {
        return;
    }

    uint32_t toWrite = (static_cast<uint32_t>(len) > _updateBytesLeft) ? _updateBytesLeft : static_cast<uint32_t>(len);

    if (!_otaUpdater.writeChunk(reinterpret_cast<const uint8_t*>(data), static_cast<size_t>(toWrite))) {
        Serial.printf("[OTA] Write failed: %s\n", _otaUpdater.lastError());
        _otaUpdater.abort();
        _updateState = UpdateState::IDLE;
        _updateLinkId = -1;
        _eraseDeadlineMs = 0;
        _uploadDiscPending = false;
        sendHttpResponse(linkId, "500 Internal Server Error", "text/plain", _otaUpdater.lastError());
        return;
    }

    _updateBytesLeft -= toWrite;
    uint32_t received = _otaUpdater.imageSize() - _updateBytesLeft;
    if ((received - _lastProgressAt >= 8192) || (_updateBytesLeft == 0)) {
        Serial.printf("[OTA] %lu / %lu bytes (%lu remaining)\n",
                      static_cast<unsigned long>(received),
                      static_cast<unsigned long>(_otaUpdater.imageSize()),
                      static_cast<unsigned long>(_updateBytesLeft));
        _lastProgressAt = received;
    }

    if (_updateBytesLeft == 0) {
        _updateState = UpdateState::IDLE;
        _updateLinkId = -1;
        _eraseDeadlineMs = 0;
        _uploadDiscPending = false;
        _lastProgressAt = 0;

        sendHttpResponse(linkId, "200 OK", "text/plain", "Update written and verified. Rebooting...");
        if (!_otaUpdater.finalize()) {
            Serial.printf("[OTA] Finalize failed: %s\n", _otaUpdater.lastError());
            return;
        }

        _pendingReboot = true;
        _rebootAt = millis() + 2000;
    }
}

// ============================================================================
// Request parsing utilities
// ============================================================================

bool ST67WifiOtaMode::looksLikeHttpRequest(const char* data, int len) const
{
    if (data == nullptr || len < 14) {
        return false;
    }

    const bool hasMethod =
        (len >= 4 && memcmp(data, "GET ", 4) == 0) ||
        (len >= 5 && memcmp(data, "POST ", 5) == 0) ||
        (len >= 5 && memcmp(data, "HEAD ", 5) == 0) ||
        (len >= 4 && memcmp(data, "PUT ", 4) == 0) ||
        (len >= 7 && memcmp(data, "DELETE ", 7) == 0) ||
        (len >= 8 && memcmp(data, "OPTIONS ", 8) == 0);

    if (!hasMethod) {
        return false;
    }

    const int scanLen = (len < 96) ? len : 96;
    for (int i = 0; i + 7 <= scanLen; ++i) {
        if (memcmp(data + i, "HTTP/1.", 7) == 0) {
            return true;
        }
    }
    return false;
}

int32_t ST67WifiOtaMode::parseContentLength(const char* request) const
{
    const char* headerNames[] = {"Content-Length:", "content-length:"};
    for (const char* name : headerNames) {
        const char* p = strstr(request, name);
        if (!p) continue;
        p += strlen(name);
        while (*p == ' ') p++;
        int32_t val = 0;
        while (*p >= '0' && *p <= '9') {
            val = val * 10 + (*p - '0');
            p++;
        }
        if (val > 0) return val;
    }
    return -1;
}

int32_t ST67WifiOtaMode::parseImageSize(const char* request) const
{
    const char* headerNames[] = {"X-Image-Size:", "x-image-size:"};
    for (const char* name : headerNames) {
        const char* p = strstr(request, name);
        if (!p) continue;
        p += strlen(name);
        while (*p == ' ') p++;
        int32_t val = 0;
        while (*p >= '0' && *p <= '9') {
            val = val * 10 + (*p - '0');
            p++;
        }
        if (val > 0) return val;
    }
    return -1;
}

void ST67WifiOtaMode::drainSpiFrames()
{
    uint8_t drain[512];
    int total = 0;
    uint32_t quietStart = millis();

    while (millis() - quietStart < 100) {
        if (_wifi.at.spi.isReady()) {
            int n = _wifi.at.spi.recvFrame(drain, sizeof(drain));
            if (n > 0) {
                total += n;
                quietStart = millis();
            }
        } else {
            delay(1);
        }
    }

    if (total > 0) {
        Serial.printf("[OTA] Drained %d stale bytes\n", total);
    }
}
